load-tests/configs/websocket-test.yml
config:
  target: 'wss://euphorie.com'  # Your main domain
  phases:
    - duration: 30
      arrivalRate: 3
      name: "WebSocket warm up"
    - duration: 60
      arrivalRate: 8
      name: "Chat connections"
  defaults:
    headers:
      User-Agent: "Artillery WebSocket Test - Euphorie"

scenarios:
  - name: "Rust WebSocket server test"
    engine: ws
    weight: 100
    flow:
      - connect:
          url: "/ws/"  # This should route to your Rust server via nginx
      - think: 2
      - send:
          data: '{"type": "auth", "user_id": "test_user", "room_id": "test_room", "username": "LoadTestUser"}'
      - think: 3
      - send:
          data: '{"type": "chat_message", "message": "Hello from Artillery!", "room_id": "test_room"}'
      - think: 2